app/views/homes/index.html.erb

      <div id="check-boxes">
        <li><%= f.collection_check_boxes :genres, Genre.all, :tmdb_id, :name, :include_hidden => false %></li>
---
SELECT "genres".* FROM "genres"