app/controllers/homes_controller.rb

  def index
    @movie
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"